test/mutations/atomic-region-ignored.patch
diff --git a/rtl/decoder.v b/rtl/decoder.v
--- a/rtl/decoder.v
+++ b/rtl/decoder.v
@@ -599,7 +599,7 @@ module decoder #(
   // other spelling, two terms each carrying their own encoding test, measured
   // 11.98 MHz at a placement this one clears.
   logic atomic_fault;
-  assign atomic_fault = instr_atomic && !atomic_supported && !word_misaligned;
+  assign atomic_fault = 1'b0;
   // The same refusal for a plain load or store, read a cycle late off the
   // flip-flop the wait above filled, so the trap chain and the pc never see the
   // effective-address adder. Misalignment outranks the region here too, so the
