test/mutations/loadstore-region-ignored.patch
diff --git a/rtl/decoder.v b/rtl/decoder.v
index 331a2ed..02bd38e 100644
--- a/rtl/decoder.v
+++ b/rtl/decoder.v
@@ -471,8 +471,7 @@ module decoder #(
   // `trap_cause`, off the fetch loop.
   logic atomic_fault;
   assign atomic_fault = instr_atomic && !atomic_supported && !word_misaligned;
-  assign ls_fault = ls_access && ls_answer_valid && !ls_answer &&
-                    !load_misaligned && !store_misaligned;
+  assign ls_fault = 1'b0;
 
   logic load_access_fault, store_access_fault;
   assign load_access_fault  = (atomic_fault && instr_lr) || (ls_fault && instr_ls_load);
