test/mutations/misa-drops-the-a-bit.patch
diff --git a/rtl/csrs.v b/rtl/csrs.v
--- a/rtl/csrs.v
+++ b/rtl/csrs.v
@@ -101,10 +101,10 @@ module csrs(
   localparam logic [11:0] MIMPID    = 12'hF13;
   localparam logic [11:0] MHARTID   = 12'hF14;

   // RV32 I M A C, MXL = 1. Bit 0 is A, and it is the only runtime statement
   // that this core implements the eleven atomics -- a -march string is what the
   // assembler accepts, not what the hardware claims.
-  localparam logic [31:0] MISA_VALUE = 32'h4000_1105;
+  localparam logic [31:0] MISA_VALUE = 32'h4000_1104;

   logic [63:0] mcycle, minstret;
   logic [31:0] mscratch, mtvec, mepc, mcause;
