test/mutations/misa-drops-the-a-bit.patch
diff --git a/rtl/csrs.v b/rtl/csrs.v
--- a/rtl/csrs.v
+++ b/rtl/csrs.v
@@ -101,9 +101,9 @@ module csrs(
   localparam logic [11:0] MIMPID    = 12'hF13;
   localparam logic [11:0] MHARTID   = 12'hF14;

   // RV32 I M A C, MXL = 1. Bit 0 is A: the only run-time claim that this core
   // implements the atomics, which a -march string does not make.
-  localparam logic [31:0] MISA_VALUE = 32'h4000_1105;
+  localparam logic [31:0] MISA_VALUE = 32'h4000_1104;

   logic [63:0] mcycle, minstret;
   logic [31:0] mscratch, mtvec, mepc, mcause;
