test/mutations/mtip-fires-a-tick-early.patch
diff --git a/rtl/timer.v b/rtl/timer.v
index fc85d37..680445e 100644
--- a/rtl/timer.v
+++ b/rtl/timer.v
@@ -95,7 +95,7 @@ module timer #(
             if (mem_wstrb[2]) cmp[55:48] <= mem_wdata[23:16];
             if (mem_wstrb[3]) cmp[63:56] <= mem_wdata[31:24];
           end
-          mtip[h] <= mtime_next >= cmp;
+          mtip[h] <= mtime_next + 64'd1 >= cmp;
         end
       end
     end
@@ -147,7 +147,7 @@ module timer #(
       end
       // Registered because it feeds the decoder's trap term on the fetch loop;
       // a write to `mtimecmp` therefore reaches `mtip` one cycle later.
-      mtip[0] <= mtime_next >= mtimecmp;
+      mtip[0] <= mtime_next + 64'd1 >= mtimecmp;
       // Zero out of range: rtl/littlesoc.v ORs the read buses together.
       mem_rdata <= in_range ? read_word : 32'b0;
     end
